drop database if exists library ;
create database library char set utf8;
use library;
create table book (
id int not null primary key auto_increment,
name_book varchar(120) not null,
descriptions text,
date_of_publications date not null default "2018-01-01",
author_name varchar(60) not null,
categoria varchar(30) not null,
isbn varchar(20) not null unique,
qty_page int not null,
author_second_name varchar(45) not null,
author_email varchar (50) unique,
age_author int not null,
author_brth_day int not null,
author_awards varchar (120) 
);
insert into book(name_book, descriptions, date_of_publications,author_name, categoria, isbn, 
qty_page, author_second_name, author_email, age_author, author_brth_day, author_awards ) values 
("сплячі красуні", "опис книги являється",default,"Овен", "хорор", "is12-2425", 256, "Кінг", "sk@mail.ua", 25, 1985-12-25, "null"),
("Чорний ворон", "опис книги являється","2017-04-05","Василь", "історична", "is13-2426",250, "Шкляр", "vs@mail.ua",24, 1986-01-25, "oscar"),
("Воно", "опис книги являється","2008-04-05","Стівен", "хорор", "is14-2325",180, "Кінг", "vk@mail.ua", 28, 1989-05-17, "dzuga"),
("Сяйво", "опис книги являється","2010-01-01","Майкл", "драма","is10-2025",150,"Кінг", "kg@mail.ua", 22, 1996-01-05,"dzuga"),
("Ловець снів", "опис книги являється",default,"Стівен", "хорор", "is18-2524",140,"Кінг", "ki@mail.ua", 35,1980-02-05, "oscar"),
("Доктор сон", "опис книги являється","2007-04-05","Орест", "драма","is17-2125",185,"Гречин","ku@mail.ua",53,1958-05-18,"globus"),
("Талісман", "опис книги являється","2009-01-01","Стів", "хорор", "is13-1715",140, "Толочкевиш","lu@mail.ua",24,1862-08-05,"dzuga"),
("Доктор сон", "опис книги являється","2012-04-05","Стівен", "хорор","is91-2128",263,"Федун","7ju@mail.ua",28,1985-08-01,"dzuga"),
("Країна розваг", "опис книги являється",default,"Дерек", "комедія", "is12-1015",685, "Керекеш","yu@mail.ua",27,1985-01-18,"globus"),
("Мізері", "опис книги являється","2011-04-05","Кейт", "хорор","is09-1815",852,"Кравчишин", "rf@mail.ua", 22, 1986-08-18, "globus"),
("інкремент", "опис книги являється",default,"Джейк", "комедія", "is91-2420",963, "Кушик", "9qk@mail.ua", 25, 1985-12-25, "globus"),
("Чорний", "опис книги являється","2017-04-05","Василь", "історична", "is03-2426",785, "Шкляр", "7s@mail.ua",24, 1986-01-25, "oscar"),
("Зона", "опис книги являється","2012-04-05","Стівен", "хорор", "is04-2325",745, "Попик", "7vk@mail.ua", 28, 1989-05-17, "dzuga"),
("Покриття", "опис книги являється","2004-04-05","Меган", "комедія","is00-2025",785,"Павловський", "5kg@mail.ua", 22, 1996-01-05,"dzuga"),
("Ловець ", "опис книги являється",default,"Катрін", "хорор", "is08-2524",412,"Стокір", "7ki@mail.ua", 35,1980-02-05, "null"),
("сон", "опис книги являється","2012-04-05","Стівен", "хорор","is07-2125",365,"Шумик","7ku@mail.ua",53,1958-05-18,"globus"),
("Отаман", "опис книги являється","2017-04-05","Дрю", "хорор", "is03-1715",452, "Веган","7lu@mail.ua",24,1862-08-05,"dzuga"),
("Сповідь", "опис книги являється","2012-04-05","Дейк", "хорор","is01-0128",415,"Кучма","3ju@mail.ua",28,1985-08-01,"dzuga"),
("Місто розваг", "опис книги являється",default,"Овен", "хорор", "is02-1005",635, "Ганич","7yu@mail.ua",27,1985-01-18,"globus"),
("Мізі", "опис книги являється","2011-04-05","Джон", "хорор","is99-1815",147,"Кравець", "7rf@mail.ua", 22, 1986-08-18, "globus"),
("Крістана ", "опис книги являється",default,"Роберт", "хорор", "is78-2524",125,"Левко", "8ki@mail.ua", 35,1980-02-05, "oscar"),
("Острів", "опис книги являється","2012-04-05","Мак", "хорор","is87-2125",362,"Петрушенко","8ku@mail.ua",53,1958-05-18,"globus"),
("Ключ", "опис книги являється","2017-04-05","Василь", "хорор", "is83-1715",415, "Петренко","8lu@mail.ua",24,1862-08-05,"dzuga"),
("Дума", "опис книги являється","2012-04-05","Тарас", "хорор","is81-0128",135,"Кобра","8ju@mail.ua",28,1985-08-01,"dzuga"),
("Чорний дим", "опис книги являється",default,"Леонід", "хорор", "is82-1005",475, "Антонів","8yu@mail.ua",27,1985-01-18,"globus"),
("Темна вежа", "опис книги являється","2011-04-05","Руслан", "хорор","is99-1115",136,"Лех", "8rf@mail.ua", 22, 1986-08-18, "globus")
;